Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetHookOrientationAngle(System.Int32)
Get the termination's rotation angle at end that is currently in the rebar.
The angle is used for both hook and crank.
end:
The end of bar. Should be 0 for start or 1 for end.
Returns:
The rotation angle at end that is currently in the rebar.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.SetHookOrientationAngle(System.Int32,System.Double)
Sets the termination's rotation angle at end.
The angle will be used for both hook and crank.
This information is set to the rebar after the API execution is finished successfully.
end:
The end of bar. Should be 0 for start or 1 for end.
angle:
The termination's rotation angle at end.
The angle will be used for both hook and crank.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not finite
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetHookPlaneNormalForBarIdx(System.Int32,System.Int32)
Returns the plane's normal in which the termination at end of bar with index barPositionIndex that is currently in Rebar.
The normal is used for both hook and crank.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
An index between 0 and (GetNumberOfBars()-1).
Returns:
The plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex that is currently in Rebar.
The normal is used for both hook and crank.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, GetNumberOfBars()-1 ].
-or-
Invalid end.
Since:
2018

Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.SetHookPlaneNormalForBarIdx(System.Int32,System.Int32,Autodesk.Revit.DB.XYZ)
Sets the plane's normal in which the termination at end of bar with index barPositionIndex will stay.
The normal will be used for both hook and crank.
This information is set to the rebar after the API execution is finished successfully.
Remarks:
This information is set to the rebar after the API execution is finished successfully. Before setting the value a validation will be done.
We consider a termination plane normal valid if it's perpendicular with the bar direction at end.
end:
The end of bar. Should be 0 for start or 1 for end.
barPositionIndex:
Index of the bar for which it will set the termination's plane normal.
terminationPlaneNormal:
The plane's normal in which the termination at end of bar with index barPositionIndex will stay.
The normal will be used for both hook and crank.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Invalid end.
-or-
terminationPlaneNormal has zero length.
Since:
2018